{
  "title": "Planificator Lamele",
  "langEN": "Engleză",
  "langRO": "Română",
  "langRU": "Rusă",

  "floorPlanAccordion": "Plan Podea",
  "dxfFileLabel": "Fișier DXF:",
  "rotateBy45": "Rotire cu 45°",
  "addLine": "Adaugă linie",
  "addRectangle": "Adaugă dreptunghi",

  "laminateCharacteristicsAccordion": "Caracteristici Lamele",
  "boardCostLabel": "Cost Placă:",
  "costPerSqm": "lei/m²",
  "boardHeightLabel": "Înălțimea plăcii:",
  "boardWidthLabel": "Lățimea plăcii:",
  "mmUnit": "mm",

  "arrangementSettingsAccordion": "Setări Aranjare",
  "wallOffsetLabel": "Decalaj perete:",
  "boardInitialCutLabel": "Tăietură inițială:",
  "smallRemainsLabel": "Nu folosi resturile mici:",
  "minBoardLengthLabel": "Rest minim de placă:",
  "arrangeModeLabel": "Mod de aranjare:",
  "arrangeModeContinue": "Continuă",
  "arrangeModeHalfShift": "Deplasare 1/2",
  "arrangeModeThirdShift": "Deplasare 1/3",
  "arrangeModeCustom": "Personalizat",
  "customArrangeHeightLabel": "Offset aranjare personalizat:",

  "viewSettingsAccordion": "Setări Vizualizare",
  "showBoardNumbersLabel": "Afișează numerele plăcilor:",

  "actionsAccordion": "Acțiuni",
  "fullCompleteButton": "Completează Tot",
  "addRowButton": "Adaugă Rând",
  "addBoardButton": "Adaugă Placă",
  "exportButton": "Exportă",

  "statisticsAccordion": "Statistici",
  "statTotalBoards": "Număr total de plăci:",
  "statTotalSquareBoards": "Suprafața totală a plăcilor:",
  "statTotalFloorSquare": "Suprafața totală a podelei:",
  "statTotalRemainingSquare": "Suprafața rămasă:",
  "statTotalCost": "Cost total:",
  "costCurrency": "lei",

  "helpAccordion": "Ajutor",
  "helpText": "Bine ați venit la Planificatorul de Parchet Laminat!<br><br> Această aplicație vă permite să vizualizați, planificați și să aranjați plăcile de parchet laminat pe schema de podea aleasă. Urmați ghidul de mai jos pentru a începe și pentru a profita la maximum de toate funcțiile disponibile.<br><br> <b>1. Încărcarea unui Plan de Podea</b><br> Deschideți un fișier DXF:<br> Faceți clic pe butonul \"Alege fișier\" și selectați un fișier .dxf valid care conține conturul podelei.<br> Puteți roti planul, adăuga o linie sau un dreptunghi.<br> Vizualizare & Zoom:<br> Odată încărcat, veți vedea liniile planului de podea în zona principală a aplicației (canvas).<br> Folosiți rotița mouse-ului sau trackpad-ul pentru a mări/reduce (zoom in/out).<br> Faceți clic și trageți pentru a vă deplasa (pan) în jurul planului.<br><br> <b>2. Setarea Parametrilor Plăcii</b><br> Dimensiunile plăcii:<br> În panoul din stânga, introduceți Lungimea și Lățimea plăcii în milimetri (sau unitățile alese).<br> Decalaj & Tăietură Inițială:<br> Decalajul plăcii (Board Offset) vă permite să deplasați rândurile succesive cu o valoare aleasă (de ex. jumătatea lățimii plăcii).<br> Tăietura inițială a plăcii (Board Initial Cut) ajută la simularea decupării primei plăci din primul rând cu o valoare specificată.<br> Resturi Minime & Alte Opțiuni:<br> Activați \"Nu folosi resturile mici\" dacă doriți să renunțați la bucățile rămase sub o lungime minimă.<br> Optimizează începutul rândului (Optimize Start the Row) încearcă să plaseze inteligent prima placă din fiecare rând.<br><br> <b>3. Adăugarea Rândurilor & Plăcilor</b><br> Adăugați un Rând sau o Placă:<br> Folosiți butonul \"Add Row\" pentru a insera un rând nou de plăci.<br> Folosiți butonul \"Add Board\" pentru a plasa următoarea placă în segmentul de rând curent.<br> Completează Tot (Full Complete):<br> Butonul \"Full Complete\" încearcă să umple toată suprafața podelei cu plăci, pe baza parametrilor actuali, creând câte rânduri și plăci sunt necesare.<br><br> <b>4. Editare & Aranjare</b><br> Zoom & Pan:<br> Folosiți rotița mouse-ului pentru zoom; țineți apăsat butonul stânga al mouse-ului și mutați pentru a realiza pan (deplasare).<br><br> <b>5. Vizualizarea Statisticilor</b><br> Secțiunea de Statistici:<br> Zona \"Statistics\" din panoul stâng afișează:<br> Numărul total de plăci folosite.<br> Suprafața totală a plăcilor.<br> Suprafața podelei acoperită.<br> Suprafața rămasă din bucățile de rest.<br> Cost Estimat pe baza costului per m² introdus.<br> Calcularea Costului:<br> Introduceți costul per metru pătrat în câmpul \"Cost\".<br> Aplicația înmulțește suprafața totală folosită cu acest cost pentru a estima costul total.<br><br> <b>6. Exportarea Planului</b><br> Export ca PDF:<br> Faceți clic pe butonul \"Export\" pentru a obține un fișier PDF care conține planul.<br><br> <b>7. Sfaturi & Depanare</b><br> Asigurați-vă că Introduceți Valorile Corecte: Verificați dacă înălțimea, lățimea, decalajul și tăietura inițială sunt numerice și au sens pentru planul dvs.<br> Plăci Mici sau Spații Neacoperite: Dacă plăcile nu umplu exact zona, ajustați restul minim sau tăietura inițială.<br> Performanță: Fișierele DXF foarte mari pot încetini randarea. Luați în considerare simplificarea planului înainte de încărcare.<br><br> <b>8. Ajutor Suplimentar</b><br> Raportare Erori (Bug Reporting):<br> Dacă întâmpinați probleme sau comportamente neașteptate, anunțați-ne creând o problemă (issue) în depozitul nostru GitHub sau contactând echipa de suport.<br><br> Sperăm că veți găsi util Planificatorul de Parchet Laminat! Dacă aveți mai multe întrebări, consultați documentația oficială sau deschideți un issue pe GitHub pentru asistență.",

  "coffeeAccordion": "Cumpără-mi o Cafea",
  "coffeeText": "De adăugat",

  "modalAddLine": "Adaugă linie",
  "startX": "Start X:",
  "startY": "Start Y:",
  "endX": "End X:",
  "endY": "End Y:",
  "closeButton": "Închide",
  "modalAddLineButton": "Adaugă linie",

  "modalAddRectangle": "Adaugă dreptunghi",
  "bottomLeftX": "Colțul stânga-jos X:",
  "bottomLeftY": "Colțul stânga-jos Y:",
  "topRightX": "Colțul dreapta-sus X:",
  "topRightY": "Colțul dreapta-sus Y:",
  "modalAddRectangleButton": "Adaugă dreptunghi"
}
